[
    {
        "id": 1,
        "name": "Players Evalutation, Bologna La Fotta - EUCF 2024 (4th place)",
        "public": true,
        "template_pj": "players-evaluation",
        "year": 2025,
        "topic": ["Sport Analysis", "Data Science"],
        "code": "https://github.com/alegalli/peLaFottaEUCF2024",
        "summary": "Players Evaluation based on the main tournament of the season. Measuring the impact of each Player on the Team.",
        "description": "<div class='pj-description'>    <h2>peLaFottaEUCF2024: Player Evaluation of BFD La Fotta at European Ultimate Championship Finals 2024</h2>        <p>        In <strong>Ultimate Frisbee</strong>, every play, every decision, every second counts. The difference between winning and losing often comes down to <strong>who steps up when it matters most</strong>. That’s why I built <strong>peLaFottaEUCF2024</strong>—a <strong>deep dive into the performance of BFD La Fotta</strong> at the European Ultimate Championship Finals 2024.    </p>        <p>        This project is <strong>not just about numbers</strong>—it’s about <strong>understanding what makes a player truly impactful</strong>, beyond the usual stats. Who’s driving the offense efficiently? Who’s making the biggest defensive plays? And most importantly, <strong>who thrives under pressure when the game is on the line?</strong>    </p>        <p>        With a mix of <strong>custom KPIs, advanced visualizations, and clutch-time analysis</strong>, this project brings Ultimate Frisbee analytics to a whole new level.    </p>          <div class='pj-image'>         <img src='assets/img/1-5_pss_played.png' alt='Top 5 players by possessions played' class='responsive project-photo'>     <p class='img-caption'>Top 5 players by possessions played.</p>     </div>          <div class='pj-image'>         <img src='assets/img/1-5_clutch_pss_played.png' alt='Top 5 players by clutch possessions played' class='responsive project-photo'>     <p class='img-caption'>Top 5 players by clutch possessions played.</p>     </div>        <h3>Breaking Down Player Impact</h3>        <h4>1. Performance Beyond the Obvious</h4>    <p>        Ultimate Frisbee stats are usually <strong>too basic</strong>—they tell you who scored, but not <strong>who made the right decisions leading to the score</strong>. I developed two custom <strong>Key Performance Indicators (KPIs)</strong> to fill this gap:    </p>    <ul>        <li><strong>Scoring Impact</strong> → Not just goals and assists, but a measure of <strong>how much a player contributes to offensive success overall</strong>.</li>        <li><strong>Block Creation</strong> → More than just recorded \"Ds\"—this metric captures <strong>who disrupts plays, forces errors, and changes the game defensively</strong>.</li>    </ul>    <p>        By analyzing these KPIs, we <strong>move past surface-level stats</strong> and highlight <strong>who’s really making things happen</strong> on the field.    </p><div class='pj-image'>         <img src='assets/img/scoring_vs_block.png' alt='Players Scoring Impact and Block Creation Rating' class='responsive project-photo'>     <p class='img-caption'>Players Scoring Impact and Block Creation Rating.</p>     </div>        <h4>2. Who Shows Up in Clutch Moments?</h4>    <p>        Being great when it’s easy is one thing. <strong>Performing under pressure is another.</strong>    </p>    <p>        One of the most exciting parts of this project is the <strong>clutch-time analysis</strong>, which isolates performances in <strong>high-stakes moments</strong>—when the game is close, time is running out, and every possession matters.    </p>    <ul>        <li><strong>Who maintains or even elevates their level of play when the pressure is on.</strong></li>        <li><strong>Who fades or struggles in clutch situations.</strong></li>    </ul>    <p>        This isn’t just interesting—it’s <strong>game-changing</strong>. It means we can <strong>spot the real difference-makers</strong>, the ones you want on the field when everything is on the line.    </p>        <div class='pj-image'>         <img src='assets/img/clutch_scoring_vs_block.png' alt='Players Scoring Impact and Block Creation Clutch Rating' class='responsive project-photo'>     <p class='img-caption'>Players Scoring Impact and Block Creation Clutch Rating.</p>     </div>        <h4>3. Making Data Instantly Understandable</h4>    <p>        Data is powerful, but only if it’s presented in a way that <strong>makes sense at a glance</strong>. That’s why I focused on <strong>data storytelling</strong>—using visuals that don’t just show numbers but <strong>tell a clear, compelling story</strong>.    </p>    <ul>        <li><strong>Top players by possessions played (regular vs. clutch)</strong> → Who’s always in the action?</li>        <li><strong>Scatterplots of scoring impact vs. block creation</strong> → Who’s an all-around force on both offense and defense?</li>        <li><strong>Comparative barplots (normal vs. clutch)</strong> → Who steps up when the pressure is highest?</li>    </ul>    <p>        Every chart is designed to be <strong>immediately useful</strong>—whether you’re a <strong>player looking to improve</strong>, a <strong>coach making lineup decisions</strong>, or just someone who loves seeing <strong>data-driven insights in sports</strong>.    </p>        <div class='pj-image'>         <img src='assets/img/scoring_impact.png' alt='Players Scoring Impact Normal vs Clutch Ranking' class='responsive project-photo'>     <p class='img-caption'>Players Scoring Impact Normal vs Clutch Ranking.</p>     </div>        <h4>4. A New Way to Look at Ultimate Frisbee Analytics</h4>    <p>        This isn’t just a one-off analysis—it’s <strong>a foundation for the future</strong>. With this approach, we’re building something that can evolve over time, with even more <strong>detailed player tracking, advanced metrics, and predictive modeling</strong>.    </p>    <p>        We’re moving Ultimate Frisbee analytics away from just <strong>“who scored the most?”</strong> and toward <strong>real performance analysis</strong>—who’s consistently <strong>making the right plays, influencing the game, and delivering when it matters</strong>.    </p>        <div class='pj-image'>         <img src='assets/img/block_creation.png' alt='Players Block Creation Normal vs Clutch Ranking' class='responsive project-photo'>     <p class='img-caption'>Players Block Creation Normal vs Clutch Ranking.</p>     </div>        <h3>Final Thoughts</h3>    <p>        peLaFottaEUCF2024 is all about <strong>seeing Ultimate Frisbee through a new lens</strong>—one that <strong>goes deeper than the highlight reel</strong> and truly <strong>measures player impact</strong>.    </p>        <h4>What stands out the most?</h4>    <ul>        <li><strong>Custom KPIs that reveal true performance</strong></li>        <li><strong>Clutch-time analysis that separates great players from good ones</strong></li>        <li><strong>Clear, insightful visualizations that turn raw data into real strategy</strong></li>    </ul>    <p>        At its core, this project isn’t just about stats. It’s about <strong>understanding the game on a deeper level</strong>, making better decisions, and pushing the boundaries of how we analyze Ultimate Frisbee.    </p>    <p>        <strong>Because in the end, the best players aren’t just skilled—they’re the ones who make the biggest impact when it counts.</strong>    </p></div>",
        "tools": ["Python", "pandas", "scikit-learn", "Seaborn"],
        "cover_photo": ["assets/img/EUCF-2024-Bologna-La-Fotta2.jpg","Carl Mardell, @ultimatepaparazzo"],
        "downloads": []
    },
    {
        "id": 2,
        "name": "conflictSahel",
        "public": true,
        "template_pj": "",
        "year": 2021,
        "topic": ["Data Science"],
        "code": "https://github.com/alegalli/conflictSahel",
        "summary": "Assess the food insecurity-conflicts vicious cycle of Liptako-Gourma.",
        "description": "<div class='pj-description'>     <h2>ConflictSahel: Understanding the Food Security-Conflict Vicious Cycle</h2>          <p>         <strong>ConflictSahel</strong> is a data-driven project analyzing the complex relationship between food insecurity, conflict, internal displacement (IDPs), and food prices in the Sahel region, with a specific focus on the <em>Liptako-Gourma</em> area, a cross-border region encompassing Burkina Faso, Mali, and Niger.     </p>          <p>        <strong>Project Scope</strong><br>         This project integrates multiple datasets, to identify patterns and correlations within the food security-conflict dynamic. By leveraging empirical analysis and advanced data visualization, ConflictSahel aims to highlight the interplay between these critical dimensions and inform humanitarian interventions.     </p>           <strong>Key Research Questions</strong><br>     <ul>         <li>What trends have emerged in the three most food-insecure provinces since 2014?</li>         <li>How have the dimensions of food security, conflict severity, and displacement evolved?</li>         <li>What are the underlying correlations between food insecurity, conflict, and IDP displacement?</li>     </ul>          <p>         <strong>Data Sources & Methodology</strong><br>         The project utilizes open-source datasets from the <strong>Cadre Harmonisé</strong>, <strong>World Food Program (WFP)</strong>, <strong>ACLED Project</strong>, and <strong>International Organization for Migration (IOM)</strong>. Analytical methods include statistical correlation testing (Pearson’s r), visualization techniques (heatmaps, time series plots), and geographic mapping to reveal spatial and temporal trends.     </p>          <p>        <strong>Findings</strong><br>         Our analysis confirms that <strong>food insecurity, conflict size, conflict severity, and IDPs size are strongly correlated</strong>, reinforcing the existence of a vicious cycle exacerbating instability in the region. However, <em>average food prices and food price stability</em> showed no significant correlation with the other dimensions, suggesting the need for further exploration.     </p>          <div class='pj-image'>         <img src='assets/img/corrgraph.png' alt='Correlation Graph between Food Insecurity, Conflict, and IDPs' class='responsive project-photo'>     <p class='img-caption'>Correlation Graph between Food Insecurity, Conflict, and IDPs.</p>      </div>          <p>        <strong>Visual Insights</strong><br>         The project's data visualization techniques effectively communicate the severity and progression of crises in the region. Heatmaps, correlation graphs, and time series plots depict how food insecurity and conflicts intertwine over time. Key observations include:     </p>     <ul>         <li>All major dimensions (food insecurity, conflict size, and IDP displacement) have worsened since 2016.</li>         <li>Menaka’s conflict size showed a decreasing trend starting in 2018, while other provinces remain volatile.</li>         <li>The correlation graph confirms the strong link between conflict intensity and forced displacement.</li>     </ul>          <div class='pj-image'>         <img src='assets/img/empirical analysis.png' alt='Empirical Analysis of the 3 most Food Insecure provinces in 2019' class='responsive project-photo'>     <p class='img-caption'>Empirical Analysis of the 3 most Food Insecure provinces in 2019.</p>     </div>          <p>           <strong>Next Steps</strong><br>         Future improvements will focus on:     </p>     <ul>         <li>Expanding food price data to include cereal and livestock prices, along with household income statistics.</li>         <li>Developing an interactive dashboard that can be updated with real time data to be consulted.</li>         <li>Enhancing statistical modeling with regression analysis and predictive forecasting.</li>     </ul>     <p>          <strong>Key Takeaways</strong><br>         The food security-conflict vicious cycle in Liptako-Gourma is self-perpetuating, requiring urgent humanitarian intervention. Strengthening resilience strategies is essential to breaking this cycle and stabilizing the region.     </p>          <p><strong>Thank you for exploring ConflictSahel.</strong></p> </div>",
        "tools": ["Python", "pandas", "scikit-learn", "Seaborn"],
        "cover_photo": ["assets/img/09-mali-sangare.jpeg","Alfredo Caliz"],
        "downloads": ["assets/files/Food Security and Conflicts - Galli Presentation.pdf", "assets/files/Food Security and Conflicts - Galli Thesis.pdf"]
    },
    {
        "id": 3,
        "name": "foodSahel",
        "public": true,
        "template_pj": "",
        "year": 2019,
        "topic": ["Data Visualization"],
        "code": "https://github.com/alegalli/foodSahel",
        "summary": "Visualization of the Liptako-Gourma food insecurity and its causes in order to asses provinces which are more in need of first aid.",
        "description": "<div class='pj-description'>     <h2>foodSahel: Data-Driven Insights for Food Security in the Sahel</h2>          <p>         <strong>Understanding Food Insecurity Through Data</strong><br>         The <em>foodSahel</em> project is a data-driven initiative designed to assess and visualize food insecurity in the          <strong>Liptako-Gourma</strong> region of the Sahel—an area deeply affected by conflict, economic instability,          and climate-related agricultural challenges. By combining multiple data sources, foodSahel uncovers          <strong>patterns of vulnerability</strong> and provides actionable insights for policymakers, humanitarian organizations,          and researchers working to mitigate food crises.     </p>      <!-- Image: Liptako-Gourma Map -->     <div class='pj-image'>         <img src='assets/img/mapLG.png' alt='Liptako-Gourma region with province borders' class='responsive project-photo'>         <p class='img-caption'>Geographical focus of foodSahel: Liptako-Gourma region.</p>     </div>      <p>         <strong>Bridging Data and Decision-Making</strong><br>         At its core, foodSahel translates complex datasets into <strong>meaningful stories</strong> that highlight the key          drivers of food insecurity. Using historical data from <strong>2014 to 2019</strong>, the project focuses on identifying:     </p>     <ul>         <li><strong>The three most afflicted provinces</strong> with the highest percentage of food-insecure people.</li>         <li><strong>Key trends over time</strong>, assessing how food insecurity has evolved across different provinces.</li>         <li><strong>The interplay between food prices, conflict, and displacement</strong>, shedding light on the vicious cycle that exacerbates hunger.</li>     </ul>      <p>         <strong>Data, Analysis &amp; Visualization</strong><br>         foodSahel integrates multiple dimensions of food security into a <strong>cohesive analytical framework</strong>:     </p>     <ul>         <li><strong>Food Insecurity</strong> – Tracking the percentage of people facing food shortages.</li>         <li><strong>Food Access &amp; Stability</strong> – Analyzing fluctuations in millet prices to gauge economic stress.</li>         <li><strong>Conflict Impact</strong> – Measuring the number of fatalities and conflict severity (fatalities per conflict).</li>         <li><strong>Displacement Crisis</strong> – Quantifying the number of <strong>Internally Displaced People (IDPs)</strong> to assess migration patterns.</li>     </ul>      <p>         Using <strong>geospatial analysis</strong>, predictive modeling, and <strong>data visualization</strong>, foodSahel transforms raw statistics into an intuitive          <em>narrative of crisis and resilience</em>.     </p>      <!-- Image: Correlation between food insecurity, conflicts, and millet prices -->     <div class='pj-image'>         <img src='assets/img/corr-mopti.png' alt='Correlation between food insecurity, conflicts, and millet prices' class='responsive project-photo'>         <p class='img-caption'>Uncovering links between food insecurity, conflicts, and market prices.</p>     </div>      <p>         <strong>Key Achievements</strong>     </p>     <ul>         <li><strong>Predictive Modeling for Food Security</strong> – Developed models that forecast food shortages by correlating biomass availability, market trends, and conflict data. These insights help <strong>anticipate</strong> humanitarian needs rather than reacting to them.</li>         <li><strong>Data-Driven Geographic Prioritization</strong> – By visualizing food insecurity at the <strong>province level</strong>, foodSahel pinpoints regions where aid is <strong>most urgently needed</strong>, enabling better resource allocation.</li>         <li><strong>Conflict &amp; Food Price Correlation Analysis</strong> – Discovered <strong>critical relationships</strong> between conflict severity, food price spikes, and displacement trends, reinforcing the understanding of food insecurity as a <strong>multi-dimensional crisis</strong>.</li>     </ul>      <p>         <strong>Impact &amp; Future Directions</strong><br>         The insights from foodSahel not only contribute to <strong>evidence-based policy decisions</strong> but also demonstrate how          <em>data storytelling</em> can be a powerful tool in humanitarian efforts. Moving forward, expanding real-time data          integration and refining predictive models could further enhance the ability to <strong>preempt food crises</strong> before they escalate.     </p>      <p>         With a compelling mix of <strong>data science, geospatial analysis, and storytelling</strong>, foodSahel turns numbers into action—         helping to <strong>inform strategies that can save lives</strong>.     </p> </div>",
        "tools": ["Python", "Seaborn"],
        "cover_photo": ["assets/img/13-the-journey.mali_.jpg","Alfredo Caliz"],
        "downloads": ["assets/files/Visualization Predict Food Security in Sahel.pdf"]
    },
    {
        "id": 4,
        "name": "Personal Portfolio alegalli.github.io",
        "public": false,
        "template_pj": "",
        "year": 2025,
        "topic": ["Web Development"],
        "code": "https://github.com/alegalli/alegalli.github.io",
        "summary": "A simple portfolio to show my Data Science Projects.",
        "description": "Starting from a template I personalized it adding cool features. Structure and UI mostly changed, creating a Personalized Project Page for each one and abilitating the Dark Mode.",
        "tools": ["html","css","JS"],
        "cover_photo": ["assets/img/home1.jpg",""],
        "downloads": []
    },
    {
        "id": 5,
        "name": "Italy u17 Mixed - EYUC17 2024 (Gold Medal)",
        "public": false,
        "template_pj": "",
        "year": 2024,
        "topic": [""],
        "code": "",
        "summary": "italy mixed is a really really really really strong team that competed in the European championship held in Gent, Belgium and won the championship!",
        "description": "",
        "tools": [],
        "cover_photo": ["assets/img/EYUC17-2024-Italy.jpg",""],
        "downloads": []
    },
    {
        "id": 6,
        "name": "toolsView",
        "public": false,
        "template_pj": "",
        "year": 2024,
        "topic": ["Web Development"],
        "code": "",
        "summary": "",
        "description": "",
        "tools": ["ReactJS", "FastAPI", "JS"],
        "cover_photo": ["assets/img/home4.jpg",""],
        "downloads": []
    },
    {
        "id": 7,
        "name": "Team Evaluation BFD La Fotta - EUCF 2024 (4th place)",
        "public": false,
        "template_pj": "",
        "year": 2025,
        "topic": [""],
        "code": "",
        "summary": "Team Evaluation based on the main tournament of the season. Measuring the impact of the whole Team compared to the other partecipating in the competition.",
        "description": "",
        "tools": [],
        "cover_photo": ["assets/img/home2.jpg",""],
        "downloads": []
    },
    {
        "id": 8,
        "name": "Improving BFD La Fotta - EUCF 2024 (4th place)",
        "public": false,
        "template_pj": "",
        "year": 2025,
        "topic": [""],
        "code": "",
        "summary": "",
        "description": "",
        "tools": [],
        "cover_photo": ["assets/img/home2.jpg",""],
        "downloads": []
    },
    {
        "id": 9,
        "name": "Opponent Scouting Template",
        "public": false,
        "template_pj": "",
        "year": 2025,
        "topic": [""],
        "code": "",
        "summary": "Performance Analysis",
        "description": "",
        "tools": [],
        "cover_photo": ["",""],
        "downloads": []
    }
]